results/memcached_bench.txt
=== Benchmarking Memcached 1.6 ===
Workload: 9:1 Read/Write (Set:Get 1:9), Gaussian Key Distribution, 2048 Bytes
================================================================

------------------------------------------------------------
MEMCACHED PIPELINE DEPTH: 1
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         6701.46          ---          ---         0.15728         0.12700         0.71900         3.13500     13664.68 
Gets        60313.15     10722.34     49590.81         0.14691         0.11900         0.63100         2.54300     23310.74 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      67014.61     10722.34     49590.81         0.14795         0.11900         0.63100         2.54300     36975.43 

------------------------------------------------------------
MEMCACHED PIPELINE DEPTH: 10
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        32733.87          ---          ---         0.30131         0.20700         1.43900         2.78300     66746.34 
Gets       294604.80     52439.66    242165.15         0.30154         0.20700         1.50300         2.78300    113996.33 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     327338.67     52439.66    242165.15         0.30152         0.20700         1.49500         2.78300    180742.67 

------------------------------------------------------------
MEMCACHED PIPELINE DEPTH: 50
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        51182.31          ---          ---         0.94693         0.43100         6.39900        11.07100    104363.83 
Gets       460640.80     81994.06    378646.74         0.94733         0.43100         6.52700        11.00700    178243.40 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     511823.11     81994.06    378646.74         0.94729         0.43100         6.49500        11.00700    282607.23