results/memcached_bench.txt
=== Benchmarking Memcached 1.6 ===
Workload: 9:1 Read/Write (Set:Get 1:9), Gaussian Key Distribution, 2048 Bytes
================================================================

------------------------------------------------------------
MEMCACHED PIPELINE DEPTH: 1
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         7418.79          ---          ---         0.15533         0.12700         0.47900         4.79900     15127.37 
Gets        66769.14         0.00     66769.14         0.13322         0.11900         0.37500         2.03900      1694.95 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      74187.94         0.00     66769.14         0.13543         0.11900         0.38300         2.25500     16822.32 

------------------------------------------------------------
MEMCACHED PIPELINE DEPTH: 10
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        36004.90          ---          ---         0.27575         0.20700         1.06300        20.47900     73416.16 
Gets       324044.07        72.01    323972.06         0.27575         0.20700         1.06300        20.47900      8372.19 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     360048.97        72.01    323972.06         0.27575         0.20700         1.06300        20.47900     81788.36 

------------------------------------------------------------
MEMCACHED PIPELINE DEPTH: 50
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        91467.88          ---          ---         0.51965         0.39100         3.05500         8.89500    186508.54 
Gets       823210.89       182.94    823027.95         0.51999         0.39100         3.05500         8.89500     21268.96 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     914678.76       182.94    823027.95         0.51996         0.39100         3.05500         8.89500    207777.50