results/redis_bench.txt
=== Benchmarking Redis 7 ===
Workload: 9:1 Read/Write (Set:Get 1:9), Gaussian Key Distribution, 2048 Bytes
================================================================

------------------------------------------------------------
REDIS PIPELINE DEPTH: 1
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         6658.14          ---          ---         0.14663         0.12700         0.57500         1.51900     13634.88 
Gets        59923.30     10653.03     49270.27         0.15129         0.13500         0.55100         2.47900     23688.10 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      66581.44     10653.03     49270.27         0.15082         0.13500         0.55100         2.44700     37322.98 

------------------------------------------------------------
REDIS PIPELINE DEPTH: 10
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        41040.46          ---          ---         0.23489         0.18300         1.13500         2.11100     84044.69 
Gets       369364.12     65746.81    303617.31         0.23517         0.18300         1.14300         2.15900    146176.73 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     410404.58     65746.81    303617.31         0.23515         0.18300         1.14300         2.12700    230221.42 

------------------------------------------------------------
REDIS PIPELINE DEPTH: 50
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        33939.26          ---          ---         1.45169         0.49500        22.78300        27.13500     69502.51 
Gets       305453.36     54370.70    251082.66         1.45201         0.49500        22.78300        27.13500    120883.90 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     339392.62     54370.70    251082.66         1.45198         0.49500        22.78300        27.13500    190386.40