results/redis_bench.txt
=== Benchmarking Redis 7 ===
Workload: 9:1 Read/Write (Set:Get 1:9), Gaussian Key Distribution, 2048 Bytes
================================================================

------------------------------------------------------------
REDIS PIPELINE DEPTH: 1
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         7320.76          ---          ---         0.13849         0.12700         0.39100         0.83900     14991.82 
Gets        65886.86         0.00     65886.86         0.13608         0.12700         0.39100         0.83900      2573.35 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      73207.62         0.00     65886.86         0.13632         0.12700         0.39100         0.83900     17565.17 

------------------------------------------------------------
REDIS PIPELINE DEPTH: 10
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        39532.25          ---          ---         0.24938         0.18300         0.88700         7.29500     80956.11 
Gets       355790.29        79.06    355711.22         0.24938         0.18300         0.88700         7.29500     14054.57 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     395322.54        79.06    355711.22         0.24938         0.18300         0.88700         7.29500     95010.68 

------------------------------------------------------------
REDIS PIPELINE DEPTH: 50
------------------------------------------------------------
2         Threads
5         Connections per thread
5000      Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        76164.94          ---          ---         0.63126         0.45500         4.12700        14.07900    155974.35 
Gets       685484.49       152.33    685332.16         0.63126         0.45500         4.12700        14.07900     27078.27 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     761649.43       152.33    685332.16         0.63126         0.45500         4.12700        14.07900    183052.62